In [1]:
import pandas as pd
import numpy as np

x = [1, 2, 3, 4, 5, 6, 7]
x = pd.Series(x)

In [2]:
x[1:4]

1    2
2    3
3    4
dtype: int64

In [3]:
x[x>3]

3    4
4    5
5    6
6    7
dtype: int64

In [4]:
x * 10

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [5]:
x.index

RangeIndex(start=0, stop=7, step=1)

In [6]:
x.values

array([1, 2, 3, 4, 5, 6, 7], dtype=int64)

In [7]:
x = [1, 2, 3, 4, 5, 6, 7]
x = pd.Series(x, index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])

In [8]:
x['b']

2

In [9]:
x[0]

1

In [10]:
x.b

2

In [11]:
x[['a','c']]

a    1
c    3
dtype: int64

In [12]:
x = {"수학":90, "영어":80, "과학":95, "미술":80}
x = pd.Series(x)
x

수학    90
영어    80
과학    95
미술    80
dtype: int64

In [13]:
x['수학']

90

In [14]:
x[0]

90

In [15]:
x['영어':]

영어    80
과학    95
미술    80
dtype: int64

In [16]:
x = {"수학":90, "영어":80, "과학":95, "미술":80}
pd.Series(x, index=["과학", "미술"])

과학    95
미술    80
dtype: int64

In [17]:
score = [50, 60, 65, 70, 90, 60, 80, 90]
index_1 = ['홍길동', '홍길동', '홍길동', '홍길동', '이몽룡', '이몽룡', '이몽룡', '이몽룡']
index_2 = ['수학', '영어', '과학', '미술', '수학', '영어', '과학', '미술']

In [18]:
pd.Series(score, index=[index_1, index_2])

홍길동  수학    50
     영어    60
     과학    65
     미술    70
이몽룡  수학    90
     영어    60
     과학    80
     미술    90
dtype: int64

In [19]:
data = [1, None, 2, None, 3, 4, None]
data = pd.Series(data)
data.sum()

10.0

In [20]:
data.isnull().sum()

3

In [21]:
data.notnull().sum()

4

In [22]:
data.dropna()

0    1.0
2    2.0
4    3.0
5    4.0
dtype: float64

In [23]:
data.fillna(0)

0    1.0
1    0.0
2    2.0
3    0.0
4    3.0
5    4.0
6    0.0
dtype: float64

In [24]:
x = pd.Series([1, 2, 3])
y = pd.Series([4, 5, 6])
z = pd.Series([7, 8, 9])
pd.concat([x, y, z])

0    1
1    2
2    3
0    4
1    5
2    6
0    7
1    8
2    9
dtype: int64

In [25]:
pd.concat([x, y, x], ignore_index=True)

0    1
1    2
2    3
3    4
4    5
5    6
6    1
7    2
8    3
dtype: int64

In [26]:
pd.concat([x, y, z], ignore_index=True, axis=1)

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [27]:
x = [1, 2, 3, 4, 5, 6, 7]
x = pd.Series(x)
x.count()

7

In [28]:
x.describe()

count    7.000000
mean     4.000000
std      2.160247
min      1.000000
25%      2.500000
50%      4.000000
75%      5.500000
max      7.000000
dtype: float64

In [29]:
x.head(2)

0    1
1    2
dtype: int64

### 실습01

In [30]:
x = [np.nan, 1, 2, 3, 4, 5]
y = pd.Series([x[np.random.randint(0, 6)] for i in range(20)])
print(y)

0     2.0
1     3.0
2     3.0
3     5.0
4     NaN
5     NaN
6     3.0
7     NaN
8     2.0
9     2.0
10    4.0
11    5.0
12    NaN
13    2.0
14    5.0
15    4.0
16    2.0
17    2.0
18    5.0
19    3.0
dtype: float64

In [31]:
# 1. 결측값 개수 구하기
y.isnull().sum()

4

In [32]:
# 2. 결측값 제거한 Series 만들기
y.dropna()

0     2.0
1     3.0
2     3.0
3     5.0
6     3.0
8     2.0
9     2.0
10    4.0
11    5.0
13    2.0
14    5.0
15    4.0
16    2.0
17    2.0
18    5.0
19    3.0
dtype: float64

In [33]:
# 3. 결측값에 y의 평균을 넣은 Series 만들기
y.fillna(y.mean())

0     2.00
1     3.00
2     3.00
3     5.00
4     3.25
5     3.25
6     3.00
7     3.25
8     2.00
9     2.00
10    4.00
11    5.00
12    3.25
13    2.00
14    5.00
15    4.00
16    2.00
17    2.00
18    5.00
19    3.00
dtype: float64

### 실습 끝

In [34]:
sales_data = {
    '연도':[2015,2016,2017,2018,2019,2020],
    '판매량':[103,70,130,160,190,230],
    '매출':[500000,300000,400000,550000,700000,680000],
    '순이익':[370000,190000,300000,480000,60000,590000]
}

In [35]:
sales_data = pd.DataFrame(sales_data)
sales_data

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000   60000
5  2020  230  680000  590000

In [36]:
sales_data['판매량']

0    103
1     70
2    130
3    160
4    190
5    230
Name: 판매량, dtype: int64

In [37]:
sales_data.iloc[1]

연도       2016
판매량        70
매출     300000
순이익    190000
Name: 1, dtype: int64

In [38]:
sales_data = {
    '연도':[2015,2016,2017,2018,2019,2020],
    '판매량':[103,70,130,160,190,230],
    '매출':[500000,300000,400000,550000,700000,680000],
    '순이익':[370000,190000,300000,480000,60000,590000]
}

sales_data = pd.DataFrame(sales_data, columns=['판매량','매출','순이익'], index=[sales_data['연도']])

In [39]:
sales_data

      판매량      매출     순이익
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018  160  550000  480000
2019  190  700000   60000
2020  230  680000  590000

In [40]:
%%writefile sales_data.csv
연도,판매량,매출,순익
2015,103,500000,370000
2016,70,300000,190000
2017,130,400000,300000
2018,60,550000,480000
2019,190,700000,600000
2020,230,680000,590000

Overwriting sales_data.csv

In [41]:
# 파일읽기
sales_data = pd.read_csv('sales_data.csv', index_col='연도', header=0, sep=',')

In [42]:
sales_data

      판매량      매출      순익
연도
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018   60  550000  480000
2019  190  700000  600000
2020  230  680000  590000

In [43]:
sales_data.to_csv('sales_data_2.csv', encoding='utf-8-sig')

In [44]:
sales_data['순이익율'] = (sales_data['순익'] / sales_data['매출']) * 100
sales_data

      판매량      매출      순익       순이익율
연도
2015  103  500000  370000  74.000000
2016   70  300000  190000  63.333333
2017  130  400000  300000  75.000000
2018   60  550000  480000  87.272727
2019  190  700000  600000  85.714286
2020  230  680000  590000  86.764706

In [47]:
def check(n):
    if n > 80:
        return '높음'
    else:
        return '낮음'

sales_data['순이익율_비교'] = sales_data['순이익율'].apply(check)
sales_data['순이익율_비교2'] = sales_data['순이익율'].apply(lambda n : '높음' if n > 80 else '낮음')
sales_data

      판매량      매출      순익       순이익율 순이익율_비교 순이익율_비교2
연도
2015  103  500000  370000  74.000000      낮음       낮음
2016   70  300000  190000  63.333333      낮음       낮음
2017  130  400000  300000  75.000000      낮음       낮음
2018   60  550000  480000  87.272727      높음       높음
2019  190  700000  600000  85.714286      높음       높음
2020  230  680000  590000  86.764706      높음       높음

In [46]:
def check(n):
    if n > 80:
        return '높음'
    else:
        return '낮음'
    
check_lambda = lambda n: '높음' if n > 80 else '낮음'
check_lambda(40)

'낮음'